# 角度反关节, 1,4,6
# 坐标系反关节 2,4,6

# get_base_coords()

# !!!!!!!!!!!左臂
# 休闲位
# ml.send_base_coords([277, 145, 525, -180, 0.0, -90],50)
# ml.send_angles([-71.22, 62.77, -35.52, 66.98, 20.46, 35.6],50) 

# 向下观察食品框
# ml.send_base_coords([330, 205, 435, -180, 0, -90],50)
# ml.send_angles([-63.2, 26.86, -76.82, 64.8, 29.83, 31.53],50) 

# 2. 向前观察零食
# ! 和右臂不一样了
# ml.send_base_coords([130, 250, 360, -90, 0.0, -90],50)
# ml.send_angles([-118.03, -9.44, -149.65, 90.54, 49.85, 47.64],50)

# 2.5 向前拿零食中间点
# ml.send_base_coords([240, 200, 370, -90, 0, -90],50)
# ml.send_angles([-71.64, -12.0, -147.11, 123.6, 80.69, 42.74],80)

# 3. 放置零食中转点
# ml.send_base_coords([230, 250, 330, -90, 0, -90],50)
# ml.send_angles([-78.68, -36.32, -154.68, 121.5, 84.93, 60.03],80)


# 识别咖啡机 开机 
# ml.send_base_coords([160, 100, 330, -90, 0, -90],50)
# ml.send_angles([-80.2, 26.03, -155.94, 98.61, 59.67, -2.27],50)

# 识别咖啡机 关机
# ml.send_base_coords([160.0, 100, 450, -90, 0, -90],50)
# ml.send_angles([-84.06, 36.75, -124.11, 106.07, 63.69, 21.31],50)



# TODO:        ！!!!!!!!!!!!!!!!!右臂

# 1. 闲置动作
# mr.send_base_coords([277, -145, 525, -180, 0.0, 90],100)
# mr.send_angles([71.22, 62.77, -35.52, -66.98, 20.46, -35.6],50)

# 2. 向下观察食品框
# mr.send_base_coords([330, -100, 435, -180, 0.0, 90],100)
# mr.send_angles([54.83, 42.13, -74.65, -57.36, 43.12, -18.74],50)

# 3. 向前观察零食
# mr.send_base_coords([130, -160, 360, 90, 0, 90],50)
# mr.send_angles([101.79, 13.49, -152.23, -86.73, 58.11, -16.5],80)

# 3.5 向前拿零食中间点
# mr.send_base_coords([240, -140, 360, 90, 0, 90],50)
# mr.send_angles([62.82, 3.01, -148.72, -127.21, 75.33, -25.8],80)

# 放零食中转点
# mr.send_base_coords([230, -140, 330, 90, 0, 90],100)
# mr.send_angles([60.89, -2.3, -157.42, -128.06, 73.95, -22.48],100)


# 3. 识别杯子
# 直接从放容器的位置开始转会碰到机械臂
# mr.send_base_coords([20, -230, 70, 90, 0, 90],10)
# mr.send_angles([-145.1, 18.55, -139.3, 46.52, 43.04, 18.39],50)


# 3.1 放容器 -> 识别杯子的中间状态 : 
# 只能用角度,用坐标也会撞到机械臂
# mr.send_angles([0,0,-115,0,90,0],50)


# 4. 转移杯子
# mr.send_base_coords([300, 0, 140, 90, 0, 90],50)




