# 角度反关节, 1,4,6
# 坐标系反关节 2,4,6

# get_base_coords()

# !!!!!!!!!!!左臂
# 角度 90, 0, 90 爪子向前  
# 1. 向前 ml.send_angles([-43.3, -10.6, -126, 140, 110, -138],50)
# 1. 向前 ml.send_base_coords([345.7, 237.5, 452.7, 90.28, -0.2, 89.96],50)


# 休闲位
# ml.send_base_coords([270, 170, 640, -180, 0.0, -90],50)
# ml.send_angles([-71.31, 63.55, -34.37, 67.69, 20.23, 36.37],50) 

# 向下观察食品框
# ml.send_base_coords([300, 280, 550, -180, 0.0, -90],50)
# ml.send_angles([-70.96, 20.55, -78.65, 65.09, 21.07, 33.55],50) 


# 2. 向前观察零食
# ! 和右臂不一样了
# ml.send_base_coords([160, 340, 450, -90, 0.0, -90],50)
# ml.send_angles([-121.66, -23.57, -141.79, 107.01, 50.43, 76.63],50)

# 2.5 向前拿零食中间点
# ml.send_base_coords([260, 200, 470, -90, 0, -90],50)
# ml.send_angles([-61.89, -4.64, -144.53, 129.69, 83.13, 34.92],80)


# 3. 放置零食中转点
# ml.send_base_coords([230, 170 , 450, -90, 0, -90],50)


# 识别咖啡机 开机 
# ml.send_base_coords([160.0, 130.0, 450.0, -90, 0.0, -90],50)
# ml.send_angles([-80.34, 27.64, -154.88, 98.17, 59.6, -2.9],50)

# 识别咖啡机 关机
# ml.send_base_coords([220.0, 200.0, 550.0, -90, 0.0, -90],50)
# ml.send_angles([-78.94, 14.88, -126.71, 117.4, 73.22, 39.54],50)





# TODO:        ！!!!!!!!!!!!!!!!!右臂


# 1. 向前 mr.send_angles([ 43.5, -10.5, -126,-140, 110, 138],50)
# 1. 向前 mr.send_base_coords([346.1, -238.1, 453.3, -90.7, -0.26, -90.16],50)

# 1. 闲置动作
# mr.send_base_coords([270, -170, 640, -180, 0.0, 90],100)
# mr.send_angles([71.31, 63.55, -34.38, -67.73, 20.23, -36.42],50)

# 2. 向下观察食品框
# mr.send_base_coords([300, -80, 550, -180, 0.0, 90],100)
# mr.send_angles([54.11, 49.62, -77.64, -50.03, 49.84, -7.57],50)

# 3. 向前观察零食
# mr.send_base_coords([160, -120, 450, 90, 0, 90],50)
# mr.send_angles([78.45, 31.27, -153.59, -98.72, 59.14, 5.55],80)

# 放零食中转点
# mr.send_base_coords([230, -170, 450,  180, 0, 0],100)
# mr.send_angles([60.12, 9.55, -131.97, -36.26, 57.35, 98.41],100)

# YZ_XANGLE
# mr.send_base_coords([230, -170, 500,   90, 0, 90],100)


# 3. 识别杯子
# 直接从放容器的位置开始转会碰到机械臂
# mr.send_base_coords([20, -230, 190, 90, 0, 90],50)
# mr.send_angles([-141.77, 25.64, -142.14, 43.76, 50.75, 9.71],50)


# mr.send_base_coords([20, -230, 200, 90, 0, 90],50)
# mr.send_angles([-144.11, 24.93, -143.94, 40.6, 51.24, 8.33],50)


# mr.send_base_coords([20, -270, 190, 90, 0, 90],50)
# mr.send_angles([-146.21, 17.68, -137.97, 46.96, 41.21, 20.35],50)

# 3.1 放容器 -> 识别杯子的中间状态 : 
# 只能用角度,用坐标也会撞到机械臂
# mr.send_angles([0,0,-115,0,90,0],50)



# 4. 转移杯子
# mr.send_base_coords([300, 0, 240, 90, 0, 90],50)




